In [2]:
import pandas as pd

In [10]:
data = pd.read_csv("data_sources/data_reqruitment/data_requirements.csv")

In [11]:
print(data.head)

<bound method NDFrame.head of       Unnamed: 0                            company  company_rating  \
0              0               PCS Global Tech\n4.7             4.7
1              1         Futuretech Consultants LLC             NaN
2              2                   Clairvoyant\n4.4             4.4
3              3                         Apple\n4.2             4.2
4              4  Skytech Consultancy Services\n5.0             5.0
...          ...                                ...             ...
1550        1550                        Paycom\n3.5             3.5
1551        1551    Amazon Data Services, Inc.\n3.7             3.7
1552        1552            Palo Alto Networks\n4.2             4.2
1553        1553                      Talent Groups             NaN
1554        1554     Gainwell Technologies LLC\n3.4             3.4

               location                                          job_title  \
0         Riverside, CA                      Data Engineer | PAID BOOTCAMP
1            Newton, MS                            Snowflake Data Engineer
2                Remote                                Data Engineer (MDM)
3         Cupertino, CA                                      Data Engineer
4         Baltimore, MD                                      Data Engineer
...                 ...                                                ...
1550  Oklahoma City, OK                                  Sr. Data Engineer
1551      Hermiston, OR  Data Center Regional Electrical Engineer (Fiel...
1552    Santa Clara, CA  Sr Principal Data Software Engineer (SASE, Cloud)
1553             Remote  Fulltime // Data Engineer (H4 EADs, L2 EADs, G...
1554      Roseville, CA       Cloud Data Engineer - Hybrid - Roseville, CA

                                        job_description      salary_estimate  \
0     Responsibilities\n· Analyze and organize raw d...   $70,000 /yr (est.)
1     My name is Dileep and I am a recruiter at Futu...    $42.50 /hr (est.)
2     Required Skills:\nMust have 5-8+ Years of expe...    $67.50 /hr (est.)
3     Summary\nPosted: Dec 22, 2021\nWeekly Hours: 4...                  NaN
4     Description of Work:\nTechnical experience in ...    $65.00 /hr (est.)
...                                                 ...                  ...
1550  This position will be located within the Devel...   $90,582 /yr (est.)
1551  Bachelor’s Degree in Electrical Engineering or...  $105,893 /yr (est.)
1552  Company Description\n\nOur Mission\nAt Palo Al...  $188,700 /yr (est.)
1553  Position: Data engineer (Live Table Structured...  $130,000 /yr (est.)
1554  Be part of a team that unleashes the power of ...   $98,850 /yr (est.)

                company_size       company_type  \
0      501 to 1000 Employees  Company - Private
1                        NaN                NaN
2        51 to 200 Employees  Company - Private
3           10000+ Employees   Company - Public
4          1 to 50 Employees   Company - Public
...                      ...                ...
1550  1001 to 5000 Employees   Company - Public
1551        10000+ Employees   Company - Public
1552        10000+ Employees   Company - Public
1553                 Unknown  Company - Private
1554        10000+ Employees  Company - Private

                      company_sector                         company_industry  \
0             Information Technology  Information Technology Support Services
1                                NaN                                      NaN
2     Pharmaceutical & Biotechnology                Biotech & Pharmaceuticals
3             Information Technology            Computer Hardware Development
4                                NaN                                      NaN
...                              ...                                      ...
1550          Information Technology  Enterprise Software & Network Solutions
1551          Information Technology                  Internet & Web Services
1552          Information Technology  Enterprise Software & Network Solutions
1553      Human Resources & Staffing                Staffing & Subcontracting
1554          Information Technology  Information Technology Support Services

      company_founded           company_revenue                      dates
0                 NaN  Unknown / Non-Applicable  2024-06-12 00:00:00-10:00
1                 NaN                       NaN  2024-06-12 00:00:00+07:00
2                 NaN  Unknown / Non-Applicable  2024-06-12 00:00:00-10:00
3              1976.0        $10+ billion (USD)  2024-06-12 00:00:00-05:00
4                 NaN  Unknown / Non-Applicable  2024-06-12 00:00:00-04:00
...               ...                       ...                        ...
1550           1998.0    $1 to $5 billion (USD)  2024-07-01 00:00:00+08:00
1551           1994.0        $10+ billion (USD)  2024-07-01 00:00:00-05:00
1552           2005.0    $1 to $5 billion (USD)  2024-07-01 00:00:00+01:00
1553              NaN  Unknown / Non-Applicable  2024-07-01 00:00:00-10:00
1554           2020.0  Unknown / Non-Applicable  2024-07-01 00:00:00+10:00

[1555 rows x 14 columns]>

In [17]:
data.isnull().sum()

Unnamed: 0            0
company               4
company_rating      197
location              1
job_title             1
job_description       1
salary_estimate     278
company_size        113
company_type        113
company_sector      295
company_industry    295
company_founded     424
company_revenue     113
dates                 0
dtype: int64

In [12]:
data.dtypes

Unnamed: 0            int64
company              object
company_rating      float64
location             object
job_title            object
job_description      object
salary_estimate      object
company_size         object
company_type         object
company_sector       object
company_industry     object
company_founded     float64
company_revenue      object
dates                object
dtype: object

In [23]:
null_rows = data[data["company"].isna()]
null_rows

,Unnamed: 0,company,company_rating,location,job_title,job_description,salary_estimate,company_size,company_type,company_sector,company_industry,company_founded,company_revenue,dates
323,323,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2024-06-16 00:00:00+07:00
525,525,NaN,NaN,"Phoenix, AZ",Data Warehouse Engineer - Remote,"At UnitedHealthcare, we’re simplifying the hea...","$100,450 /yr (est.)",10000+ Employees,Company - Public,Healthcare,Health Care Services & Hospitals,1977.0,$10+ billion (USD),2024-06-18 00:00:00+10:00
529,529,NaN,NaN,"Minnetonka, MN",Data Engineer - Remote,"At UnitedHealthcare, we’re simplifying the hea...","$100,450 /yr (est.)",10000+ Employees,Company - Public,Healthcare,Health Care Services & Hospitals,1977.0,$10+ billion (USD),2024-06-18 00:00:00-04:00
667,667,NaN,NaN,"Englewood, CO",Senior Data Engineer,Department Summary\n\nDISH is a Fortune 200 co...,"$115,625 /yr (est.)",10000+ Employees,Company - Public,Telecommunications,"Cable, Internet & Telephone Providers",1980.0,$10+ billion (USD),2024-06-20 00:00:00-05:00

In [34]:
one_non_null = data[data.notna().sum(axis=1) == 1]
one_non_null

Empty DataFrame
Columns: [Unnamed: 0, company, company_rating, location, job_title, job_description, salary_estimate, company_size, company_type, company_sector, company_industry, company_founded, company_revenue, dates]
Index: []

In [35]:
data['dates']

0       2024-06-12 00:00:00-10:00
1       2024-06-12 00:00:00+07:00
2       2024-06-12 00:00:00-10:00
3       2024-06-12 00:00:00-05:00
4       2024-06-12 00:00:00-04:00
                  ...
1550    2024-07-01 00:00:00+08:00
1551    2024-07-01 00:00:00-05:00
1552    2024-07-01 00:00:00+01:00
1553    2024-07-01 00:00:00-10:00
1554    2024-07-01 00:00:00+10:00
Name: dates, Length: 1555, dtype: object